program(7)
. <identifier>(1)
. . TestPrimes(0)
. consts(0)
. types(2)
. . type(2)
. . . <identifier>(1)
. . . . Result(0)
. . . lit(3)
. . . . <identifier>(1)
. . . . . Composite(0)
. . . . <identifier>(1)
. . . . . Prime(0)
. . . . <identifier>(1)
. . . . . TooBig(0)
. . type(2)
. . . <identifier>(1)
. . . . color(0)
. . . lit(9)
. . . . <identifier>(1)
. . . . . red(0)
. . . . <identifier>(1)
. . . . . white(0)
. . . . <identifier>(1)
. . . . . blue(0)
. . . . <identifier>(1)
. . . . . green(0)
. . . . <identifier>(1)
. . . . . purple(0)
. . . . <identifier>(1)
. . . . . cyan(0)
. . . . <identifier>(1)
. . . . . magenta(0)
. . . . <identifier>(1)
. . . . . orange(0)
. . . . <identifier>(1)
. . . . . black(0)
. dclns(1)
. . var(2)
. . . <identifier>(1)
. . . . n(0)
. . . <identifier>(1)
. . . . integer(0)
. subprogs(5)
. . fcn(8)
. . . <identifier>(1)
. . . . ColorValue(0)
. . . params(1)
. . . . var(2)
. . . . . <identifier>(1)
. . . . . . c(0)
. . . . . <identifier>(1)
. . . . . . color(0)
. . . <identifier>(1)
. . . . integer(0)
. . . consts(0)
. . . types(0)
. . . dclns(0)
. . . block(1)
. . . . case(10)
. . . . . <identifier>(1)
. . . . . . c(0)
. . . . . case_clause(2)
. . . . . . <identifier>(1)
. . . . . . . red(0)
. . . . . . return(1)
. . . . . . . <integer>(1)
. . . . . . . . 0(0)
. . . . . case_clause(2)
. . . . . . <identifier>(1)
. . . . . . . white(0)
. . . . . . return(1)
. . . . . . . <integer>(1)
. . . . . . . . 1(0)
. . . . . case_clause(2)
. . . . . . <identifier>(1)
. . . . . . . blue(0)
. . . . . . return(1)
. . . . . . . <integer>(1)
. . . . . . . . 2(0)
. . . . . case_clause(2)
. . . . . . <identifier>(1)
. . . . . . . green(0)
. . . . . . return(1)
. . . . . . . <integer>(1)
. . . . . . . . 3(0)
. . . . . case_clause(2)
. . . . . . <identifier>(1)
. . . . . . . purple(0)
. . . . . . return(1)
. . . . . . . <integer>(1)
. . . . . . . . 4(0)
. . . . . case_clause(2)
. . . . . . <identifier>(1)
. . . . . . . cyan(0)
. . . . . . return(1)
. . . . . . . <integer>(1)
. . . . . . . . 5(0)
. . . . . case_clause(2)
. . . . . . <identifier>(1)
. . . . . . . magenta(0)
. . . . . . return(1)
. . . . . . . <integer>(1)
. . . . . . . . 6(0)
. . . . . case_clause(2)
. . . . . . <identifier>(1)
. . . . . . . orange(0)
. . . . . . return(1)
. . . . . . . <integer>(1)
. . . . . . . . 7(0)
. . . . . case_clause(2)
. . . . . . <identifier>(1)
. . . . . . . black(0)
. . . . . . return(1)
. . . . . . . <integer>(1)
. . . . . . . . 8(0)
. . . <identifier>(1)
. . . . ColorValue(0)
. . fcn(8)
. . . <identifier>(1)
. . . . Color(0)
. . . params(1)
. . . . var(2)
. . . . . <identifier>(1)
. . . . . . n(0)
. . . . . <identifier>(1)
. . . . . . integer(0)
. . . <identifier>(1)
. . . . color(0)
. . . consts(0)
. . . types(0)
. . . dclns(0)
. . . block(1)
. . . . case(3)
. . . . . <identifier>(1)
. . . . . . n(0)
. . . . . case_clause(2)
. . . . . . ..(2)
. . . . . . . <integer>(1)
. . . . . . . . 0(0)
. . . . . . . <integer>(1)
. . . . . . . . 8(0)
. . . . . . case(10)
. . . . . . . <identifier>(1)
. . . . . . . . n(0)
. . . . . . . case_clause(2)
. . . . . . . . <integer>(1)
. . . . . . . . . 0(0)
. . . . . . . . return(1)
. . . . . . . . . <identifier>(1)
. . . . . . . . . . red(0)
. . . . . . . case_clause(2)
. . . . . . . . <integer>(1)
. . . . . . . . . 1(0)
. . . . . . . . return(1)
. . . . . . . . . <identifier>(1)
. . . . . . . . . . white(0)
. . . . . . . case_clause(2)
. . . . . . . . <integer>(1)
. . . . . . . . . 2(0)
. . . . . . . . return(1)
. . . . . . . . . <identifier>(1)
. . . . . . . . . . blue(0)
. . . . . . . case_clause(2)
. . . . . . . . <integer>(1)
. . . . . . . . . 3(0)
. . . . . . . . return(1)
. . . . . . . . . <identifier>(1)
. . . . . . . . . . green(0)
. . . . . . . case_clause(2)
. . . . . . . . <integer>(1)
. . . . . . . . . 4(0)
. . . . . . . . return(1)
. . . . . . . . . <identifier>(1)
. . . . . . . . . . purple(0)
. . . . . . . case_clause(2)
. . . . . . . . <integer>(1)
. . . . . . . . . 5(0)
. . . . . . . . return(1)
. . . . . . . . . <identifier>(1)
. . . . . . . . . . cyan(0)
. . . . . . . case_clause(2)
. . . . . . . . <integer>(1)
. . . . . . . . . 6(0)
. . . . . . . . return(1)
. . . . . . . . . <identifier>(1)
. . . . . . . . . . magenta(0)
. . . . . . . case_clause(2)
. . . . . . . . <integer>(1)
. . . . . . . . . 7(0)
. . . . . . . . return(1)
. . . . . . . . . <identifier>(1)
. . . . . . . . . . orange(0)
. . . . . . . case_clause(2)
. . . . . . . . <integer>(1)
. . . . . . . . . 8(0)
. . . . . . . . return(1)
. . . . . . . . . <identifier>(1)
. . . . . . . . . . black(0)
. . . . . otherwise(1)
. . . . . . return(1)
. . . . . . . call(2)
. . . . . . . . <identifier>(1)
. . . . . . . . . Color(0)
. . . . . . . . mod(2)
. . . . . . . . . <identifier>(1)
. . . . . . . . . . n(0)
. . . . . . . . . <integer>(1)
. . . . . . . . . . 9(0)
. . . <identifier>(1)
. . . . Color(0)
. . fcn(8)
. . . <identifier>(1)
. . . . print(0)
. . . params(1)
. . . . var(2)
. . . . . <identifier>(1)
. . . . . . i(0)
. . . . . <identifier>(1)
. . . . . . integer(0)
. . . <identifier>(1)
. . . . integer(0)
. . . consts(0)
. . . types(1)
. . . . type(2)
. . . . . <identifier>(1)
. . . . . . Result(0)
. . . . . lit(3)
. . . . . . <identifier>(1)
. . . . . . . red(0)
. . . . . . <identifier>(1)
. . . . . . . white(0)
. . . . . . <identifier>(1)
. . . . . . . blue(0)
. . . dclns(1)
. . . . var(2)
. . . . . <identifier>(1)
. . . . . . color(0)
. . . . . <identifier>(1)
. . . . . . Result(0)
. . . block(3)
. . . . case(5)
. . . . . <identifier>(1)
. . . . . . i(0)
. . . . . case_clause(2)
. . . . . . <integer>(1)
. . . . . . . 0(0)
. . . . . . assign(2)
. . . . . . . <identifier>(1)
. . . . . . . . color(0)
. . . . . . . <identifier>(1)
. . . . . . . . red(0)
. . . . . case_clause(2)
. . . . . . <integer>(1)
. . . . . . . 1(0)
. . . . . . assign(2)
. . . . . . . <identifier>(1)
. . . . . . . . color(0)
. . . . . . . <identifier>(1)
. . . . . . . . white(0)
. . . . . case_clause(2)
. . . . . . <integer>(1)
. . . . . . . 2(0)
. . . . . . assign(2)
. . . . . . . <identifier>(1)
. . . . . . . . color(0)
. . . . . . . <identifier>(1)
. . . . . . . . blue(0)
. . . . . otherwise(1)
. . . . . . assign(2)
. . . . . . . <identifier>(1)
. . . . . . . . color(0)
. . . . . . . <identifier>(1)
. . . . . . . . red(0)
. . . . if(3)
. . . . . =(2)
. . . . . . <identifier>(1)
. . . . . . . color(0)
. . . . . . <identifier>(1)
. . . . . . . red(0)
. . . . . output(1)
. . . . . . integer(1)
. . . . . . . <integer>(1)
. . . . . . . . 0(0)
. . . . . if(3)
. . . . . . =(2)
. . . . . . . <identifier>(1)
. . . . . . . . color(0)
. . . . . . . <identifier>(1)
. . . . . . . . white(0)
. . . . . . output(1)
. . . . . . . integer(1)
. . . . . . . . <integer>(1)
. . . . . . . . . 1(0)
. . . . . . output(1)
. . . . . . . integer(1)
. . . . . . . . <integer>(1)
. . . . . . . . . 2(0)
. . . . <null>(0)
. . . <identifier>(1)
. . . . print(0)
. . fcn(8)
. . . <identifier>(1)
. . . . Ord(0)
. . . params(1)
. . . . var(2)
. . . . . <identifier>(1)
. . . . . . R(0)
. . . . . <identifier>(1)
. . . . . . Result(0)
. . . <identifier>(1)
. . . . integer(0)
. . . consts(0)
. . . types(0)
. . . dclns(0)
. . . block(1)
. . . . case(4)
. . . . . <identifier>(1)
. . . . . . R(0)
. . . . . case_clause(2)
. . . . . . <identifier>(1)
. . . . . . . Composite(0)
. . . . . . return(1)
. . . . . . . <integer>(1)
. . . . . . . . 0(0)
. . . . . case_clause(2)
. . . . . . <identifier>(1)
. . . . . . . Prime(0)
. . . . . . return(1)
. . . . . . . <integer>(1)
. . . . . . . . 1(0)
. . . . . case_clause(2)
. . . . . . <identifier>(1)
. . . . . . . TooBig(0)
. . . . . . return(1)
. . . . . . . <integer>(1)
. . . . . . . . 2(0)
. . . <identifier>(1)
. . . . Ord(0)
. . fcn(8)
. . . <identifier>(1)
. . . . IsPrime(0)
. . . params(1)
. . . . var(2)
. . . . . <identifier>(1)
. . . . . . n(0)
. . . . . <identifier>(1)
. . . . . . integer(0)
. . . <identifier>(1)
. . . . Result(0)
. . . consts(0)
. . . types(0)
. . . dclns(2)
. . . . var(2)
. . . . . <identifier>(1)
. . . . . . i(0)
. . . . . <identifier>(1)
. . . . . . integer(0)
. . . . var(2)
. . . . . <identifier>(1)
. . . . . . MightBePrime(0)
. . . . . <identifier>(1)
. . . . . . boolean(0)
. . . block(1)
. . . . case(3)
. . . . . <identifier>(1)
. . . . . . n(0)
. . . . . case_clause(2)
. . . . . . ..(2)
. . . . . . . <integer>(1)
. . . . . . . . 1(0)
. . . . . . . <integer>(1)
. . . . . . . . 500(0)
. . . . . . case(3)
. . . . . . . <identifier>(1)
. . . . . . . . n(0)
. . . . . . . case_clause(2)
. . . . . . . . ..(2)
. . . . . . . . . <integer>(1)
. . . . . . . . . . 1(0)
. . . . . . . . . <integer>(1)
. . . . . . . . . . 100(0)
. . . . . . . . case(27)
. . . . . . . . . <identifier>(1)
. . . . . . . . . . n(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 2(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 3(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 5(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 7(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 11(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 13(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 17(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 19(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 23(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 29(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 31(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 37(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 41(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 43(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 47(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 53(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 59(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 61(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 67(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 71(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 73(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 79(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 83(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 89(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . case_clause(2)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 97(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . otherwise(1)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Composite(0)
. . . . . . . otherwise(1)
. . . . . . . . block(5)
. . . . . . . . . assign(2)
. . . . . . . . . . <identifier>(1)
. . . . . . . . . . . MightBePrime(0)
. . . . . . . . . . or(2)
. . . . . . . . . . . =(2)
. . . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . . n(0)
. . . . . . . . . . . . <integer>(1)
. . . . . . . . . . . . . 2(0)
. . . . . . . . . . . =(2)
. . . . . . . . . . . . mod(2)
. . . . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . . . n(0)
. . . . . . . . . . . . . <integer>(1)
. . . . . . . . . . . . . . 2(0)
. . . . . . . . . . . . <integer>(1)
. . . . . . . . . . . . . 1(0)
. . . . . . . . . assign(2)
. . . . . . . . . . <identifier>(1)
. . . . . . . . . . . i(0)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 3(0)
. . . . . . . . . while(2)
. . . . . . . . . . and(2)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . MightBePrime(0)
. . . . . . . . . . . <=(2)
. . . . . . . . . . . . *(2)
. . . . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . . . i(0)
. . . . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . . . i(0)
. . . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . . n(0)
. . . . . . . . . . if(3)
. . . . . . . . . . . =(2)
. . . . . . . . . . . . mod(2)
. . . . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . . . n(0)
. . . . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . . . i(0)
. . . . . . . . . . . . <integer>(1)
. . . . . . . . . . . . . 0(0)
. . . . . . . . . . . assign(2)
. . . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . . MightBePrime(0)
. . . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . . false(0)
. . . . . . . . . . . assign(2)
. . . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . . i(0)
. . . . . . . . . . . . +(2)
. . . . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . . . i(0)
. . . . . . . . . . . . . <integer>(1)
. . . . . . . . . . . . . . 2(0)
. . . . . . . . . if(3)
. . . . . . . . . . <identifier>(1)
. . . . . . . . . . . MightBePrime(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Prime(0)
. . . . . . . . . . return(1)
. . . . . . . . . . . <identifier>(1)
. . . . . . . . . . . . Composite(0)
. . . . . . . . . <null>(0)
. . . . . otherwise(1)
. . . . . . return(1)
. . . . . . . <identifier>(1)
. . . . . . . . TooBig(0)
. . . <identifier>(1)
. . . . IsPrime(0)
. block(1)
. . repeat(3)
. . . read(1)
. . . . <identifier>(1)
. . . . . n(0)
. . . output(1)
. . . . integer(1)
. . . . . call(2)
. . . . . . <identifier>(1)
. . . . . . . Ord(0)
. . . . . . call(2)
. . . . . . . <identifier>(1)
. . . . . . . . IsPrime(0)
. . . . . . . call(2)
. . . . . . . . <identifier>(1)
. . . . . . . . . ColorValue(0)
. . . . . . . . call(2)
. . . . . . . . . <identifier>(1)
. . . . . . . . . . Color(0)
. . . . . . . . . <identifier>(1)
. . . . . . . . . . n(0)
. . . eof(0)
. <identifier>(1)
. . TestPrimes(0)
