program(7)
. <identifier>(1)
. . TestPrimes(0)
. consts(0)
. types(0)
. dclns(1)
. . var(2)
. . . <identifier>(1)
. . . . n(0)
. . . <identifier>(1)
. . . . integer(0)
. subprogs(1)
. . fcn(8)
. . . <identifier>(1)
. . . . IsPrime(0)
. . . params(1)
. . . . var(2)
. . . . . <identifier>(1)
. . . . . . n(0)
. . . . . <identifier>(1)
. . . . . . integer(0)
. . . <identifier>(1)
. . . . boolean(0)
. . . consts(0)
. . . types(0)
. . . dclns(2)
. . . . var(2)
. . . . . <identifier>(1)
. . . . . . i(0)
. . . . . <identifier>(1)
. . . . . . integer(0)
. . . . var(2)
. . . . . <identifier>(1)
. . . . . . Prime(0)
. . . . . <identifier>(1)
. . . . . . boolean(0)
. . . block(4)
. . . . assign(2)
. . . . . <identifier>(1)
. . . . . . Prime(0)
. . . . . or(2)
. . . . . . =(2)
. . . . . . . <identifier>(1)
. . . . . . . . n(0)
. . . . . . . <integer>(1)
. . . . . . . . 2(0)
. . . . . . =(2)
. . . . . . . mod(2)
. . . . . . . . <identifier>(1)
. . . . . . . . . n(0)
. . . . . . . . <integer>(1)
. . . . . . . . . 2(0)
. . . . . . . <integer>(1)
. . . . . . . . 1(0)
. . . . assign(2)
. . . . . <identifier>(1)
. . . . . . i(0)
. . . . . <integer>(1)
. . . . . . 3(0)
. . . . while(2)
. . . . . and(2)
. . . . . . <identifier>(1)
. . . . . . . Prime(0)
. . . . . . <=(2)
. . . . . . . *(2)
. . . . . . . . <identifier>(1)
. . . . . . . . . i(0)
. . . . . . . . <identifier>(1)
. . . . . . . . . i(0)
. . . . . . . <identifier>(1)
. . . . . . . . n(0)
. . . . . if(3)
. . . . . . =(2)
. . . . . . . mod(2)
. . . . . . . . <identifier>(1)
. . . . . . . . . n(0)
. . . . . . . . <identifier>(1)
. . . . . . . . . i(0)
. . . . . . . <integer>(1)
. . . . . . . . 0(0)
. . . . . . assign(2)
. . . . . . . <identifier>(1)
. . . . . . . . Prime(0)
. . . . . . . <identifier>(1)
. . . . . . . . false(0)
. . . . . . assign(2)
. . . . . . . <identifier>(1)
. . . . . . . . i(0)
. . . . . . . +(2)
. . . . . . . . <identifier>(1)
. . . . . . . . . i(0)
. . . . . . . . <integer>(1)
. . . . . . . . . 2(0)
. . . . return(1)
. . . . . <identifier>(1)
. . . . . . Prime(0)
. . . <identifier>(1)
. . . . IsPrime(0)
. block(1)
. . repeat(3)
. . . read(1)
. . . . <identifier>(1)
. . . . . n(0)
. . . case(3)
. . . . call(2)
. . . . . <identifier>(1)
. . . . . . IsPrime(0)
. . . . . <identifier>(1)
. . . . . . n(0)
. . . . case_clause(2)
. . . . . <identifier>(1)
. . . . . . true(0)
. . . . . output(1)
. . . . . . integer(1)
. . . . . . . <integer>(1)
. . . . . . . . 1(0)
. . . . case_clause(2)
. . . . . <identifier>(1)
. . . . . . false(0)
. . . . . output(1)
. . . . . . integer(1)
. . . . . . . <integer>(1)
. . . . . . . . 0(0)
. . . eof(0)
. <identifier>(1)
. . TestPrimes(0)
