program(7)
. <identifier>(1)
. . Ackerman(0)
. consts(0)
. types(0)
. dclns(1)
. . var(3)
. . . <identifier>(1)
. . . . m(0)
. . . <identifier>(1)
. . . . n(0)
. . . <identifier>(1)
. . . . integer(0)
. subprogs(1)
. . fcn(8)
. . . <identifier>(1)
. . . . ackerman(0)
. . . params(1)
. . . . var(3)
. . . . . <identifier>(1)
. . . . . . m(0)
. . . . . <identifier>(1)
. . . . . . n(0)
. . . . . <identifier>(1)
. . . . . . integer(0)
. . . <identifier>(1)
. . . . integer(0)
. . . consts(0)
. . . types(0)
. . . dclns(0)
. . . block(1)
. . . . if(3)
. . . . . =(2)
. . . . . . <identifier>(1)
. . . . . . . m(0)
. . . . . . <integer>(1)
. . . . . . . 0(0)
. . . . . return(1)
. . . . . . +(2)
. . . . . . . <identifier>(1)
. . . . . . . . n(0)
. . . . . . . <integer>(1)
. . . . . . . . 1(0)
. . . . . if(3)
. . . . . . =(2)
. . . . . . . <identifier>(1)
. . . . . . . . n(0)
. . . . . . . <integer>(1)
. . . . . . . . 0(0)
. . . . . . return(1)
. . . . . . . call(3)
. . . . . . . . <identifier>(1)
. . . . . . . . . ackerman(0)
. . . . . . . . -(2)
. . . . . . . . . <identifier>(1)
. . . . . . . . . . m(0)
. . . . . . . . . <integer>(1)
. . . . . . . . . . 1(0)
. . . . . . . . <integer>(1)
. . . . . . . . . 1(0)
. . . . . . return(1)
. . . . . . . call(3)
. . . . . . . . <identifier>(1)
. . . . . . . . . ackerman(0)
. . . . . . . . -(2)
. . . . . . . . . <identifier>(1)
. . . . . . . . . . m(0)
. . . . . . . . . <integer>(1)
. . . . . . . . . . 1(0)
. . . . . . . . call(3)
. . . . . . . . . <identifier>(1)
. . . . . . . . . . ackerman(0)
. . . . . . . . . <identifier>(1)
. . . . . . . . . . m(0)
. . . . . . . . . -(2)
. . . . . . . . . . <identifier>(1)
. . . . . . . . . . . n(0)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 1(0)
. . . <identifier>(1)
. . . . ackerman(0)
. block(1)
. . while(2)
. . . not(1)
. . . . eof(0)
. . . block(3)
. . . . read(1)
. . . . . <identifier>(1)
. . . . . . m(0)
. . . . read(1)
. . . . . <identifier>(1)
. . . . . . n(0)
. . . . output(3)
. . . . . integer(1)
. . . . . . <identifier>(1)
. . . . . . . m(0)
. . . . . integer(1)
. . . . . . <identifier>(1)
. . . . . . . n(0)
. . . . . integer(1)
. . . . . . call(3)
. . . . . . . <identifier>(1)
. . . . . . . . ackerman(0)
. . . . . . . <identifier>(1)
. . . . . . . . m(0)
. . . . . . . <identifier>(1)
. . . . . . . . n(0)
. <identifier>(1)
. . Ackerman(0)
