program(7)
. <identifier>(1)
. . Fibonacci(0)
. consts(0)
. types(0)
. dclns(1)
. . var(2)
. . . <identifier>(1)
. . . . i(0)
. . . <identifier>(1)
. . . . integer(0)
. subprogs(1)
. . fcn(8)
. . . <identifier>(1)
. . . . fibonacci(0)
. . . params(1)
. . . . var(2)
. . . . . <identifier>(1)
. . . . . . n(0)
. . . . . <identifier>(1)
. . . . . . integer(0)
. . . <identifier>(1)
. . . . integer(0)
. . . consts(0)
. . . types(0)
. . . dclns(0)
. . . block(1)
. . . . if(3)
. . . . . =(2)
. . . . . . <identifier>(1)
. . . . . . . n(0)
. . . . . . <integer>(1)
. . . . . . . 0(0)
. . . . . return(1)
. . . . . . <integer>(1)
. . . . . . . 0(0)
. . . . . if(3)
. . . . . . =(2)
. . . . . . . <identifier>(1)
. . . . . . . . n(0)
. . . . . . . <integer>(1)
. . . . . . . . 1(0)
. . . . . . return(1)
. . . . . . . <integer>(1)
. . . . . . . . 1(0)
. . . . . . return(1)
. . . . . . . +(2)
. . . . . . . . call(2)
. . . . . . . . . <identifier>(1)
. . . . . . . . . . fibonacci(0)
. . . . . . . . . -(2)
. . . . . . . . . . <identifier>(1)
. . . . . . . . . . . n(0)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 1(0)
. . . . . . . . call(2)
. . . . . . . . . <identifier>(1)
. . . . . . . . . . fibonacci(0)
. . . . . . . . . -(2)
. . . . . . . . . . <identifier>(1)
. . . . . . . . . . . n(0)
. . . . . . . . . . <integer>(1)
. . . . . . . . . . . 2(0)
. . . <identifier>(1)
. . . . fibonacci(0)
. block(1)
. . for(4)
. . . assign(2)
. . . . <identifier>(1)
. . . . . i(0)
. . . . <integer>(1)
. . . . . 1(0)
. . . <=(2)
. . . . <identifier>(1)
. . . . . i(0)
. . . . <integer>(1)
. . . . . 7(0)
. . . assign(2)
. . . . <identifier>(1)
. . . . . i(0)
. . . . +(2)
. . . . . <identifier>(1)
. . . . . . i(0)
. . . . . <integer>(1)
. . . . . . 1(0)
. . . block(1)
. . . . output(1)
. . . . . integer(1)
. . . . . . call(2)
. . . . . . . <identifier>(1)
. . . . . . . . fibonacci(0)
. . . . . . . <identifier>(1)
. . . . . . . . i(0)
. <identifier>(1)
. . Fibonacci(0)
