program(7)
. <identifier>(1)
. . pr5c23(0)
. consts(0)
. types(0)
. dclns(2)
. . var(2)
. . . <identifier>(1)
. . . . a(0)
. . . <identifier>(1)
. . . . integer(0)
. . var(2)
. . . <identifier>(1)
. . . . b(0)
. . . <identifier>(1)
. . . . boolean(0)
. subprogs(1)
. . fcn(8)
. . . <identifier>(1)
. . . . y(0)
. . . params(2)
. . . . var(2)
. . . . . <identifier>(1)
. . . . . . b(0)
. . . . . <identifier>(1)
. . . . . . integer(0)
. . . . var(2)
. . . . . <identifier>(1)
. . . . . . a(0)
. . . . . <identifier>(1)
. . . . . . boolean(0)
. . . <identifier>(1)
. . . . integer(0)
. . . consts(0)
. . . types(0)
. . . dclns(0)
. . . block(1)
. . . . if(3)
. . . . . <identifier>(1)
. . . . . . a(0)
. . . . . output(1)
. . . . . . integer(1)
. . . . . . . <integer>(1)
. . . . . . . . 1(0)
. . . . . output(1)
. . . . . . integer(1)
. . . . . . . <identifier>(1)
. . . . . . . . b(0)
. . . <identifier>(1)
. . . . y(0)
. block(5)
. . assign(2)
. . . <identifier>(1)
. . . . a(0)
. . . <integer>(1)
. . . . 13(0)
. . assign(2)
. . . <identifier>(1)
. . . . b(0)
. . . <identifier>(1)
. . . . false(0)
. . output(1)
. . . integer(1)
. . . . <integer>(1)
. . . . . 0(0)
. . assign(2)
. . . <identifier>(1)
. . . . d(0)
. . . call(3)
. . . . <identifier>(1)
. . . . . y(0)
. . . . <identifier>(1)
. . . . . a(0)
. . . . <identifier>(1)
. . . . . b(0)
. . output(1)
. . . integer(1)
. . . . <integer>(1)
. . . . . 0(0)
. <identifier>(1)
. . pr5c23(0)
