program(7)
. <identifier>(1)
. . factors(0)
. consts(0)
. types(0)
. dclns(1)
. . var(2)
. . . <identifier>(1)
. . . . i(0)
. . . <identifier>(1)
. . . . integer(0)
. subprogs(1)
. . fcn(8)
. . . <identifier>(1)
. . . . Factor(0)
. . . params(1)
. . . . var(2)
. . . . . <identifier>(1)
. . . . . . i(0)
. . . . . <identifier>(1)
. . . . . . integer(0)
. . . <identifier>(1)
. . . . integer(0)
. . . consts(0)
. . . types(0)
. . . dclns(1)
. . . . var(2)
. . . . . <identifier>(1)
. . . . . . j(0)
. . . . . <identifier>(1)
. . . . . . integer(0)
. . . block(1)
. . . . if(2)
. . . . . >(2)
. . . . . . <identifier>(1)
. . . . . . . i(0)
. . . . . . <integer>(1)
. . . . . . . 0(0)
. . . . . for(4)
. . . . . . assign(2)
. . . . . . . <identifier>(1)
. . . . . . . . j(0)
. . . . . . . <integer>(1)
. . . . . . . . 1(0)
. . . . . . <=(2)
. . . . . . . <identifier>(1)
. . . . . . . . j(0)
. . . . . . . <identifier>(1)
. . . . . . . . i(0)
. . . . . . assign(2)
. . . . . . . <identifier>(1)
. . . . . . . . j(0)
. . . . . . . +(2)
. . . . . . . . <identifier>(1)
. . . . . . . . . j(0)
. . . . . . . . <integer>(1)
. . . . . . . . . 1(0)
. . . . . . if(2)
. . . . . . . =(2)
. . . . . . . . mod(2)
. . . . . . . . . <identifier>(1)
. . . . . . . . . . i(0)
. . . . . . . . . <identifier>(1)
. . . . . . . . . . j(0)
. . . . . . . . <integer>(1)
. . . . . . . . . 0(0)
. . . . . . . output(1)
. . . . . . . . integer(1)
. . . . . . . . . <identifier>(1)
. . . . . . . . . . j(0)
. . . <identifier>(1)
. . . . Factor(0)
. block(1)
. . repeat(3)
. . . read(1)
. . . . <identifier>(1)
. . . . . i(0)
. . . assign(2)
. . . . <identifier>(1)
. . . . . d(0)
. . . . call(2)
. . . . . <identifier>(1)
. . . . . . Factor(0)
. . . . . <identifier>(1)
. . . . . . i(0)
. . . <=(2)
. . . . <identifier>(1)
. . . . . i(0)
. . . . <integer>(1)
. . . . . 0(0)
. <identifier>(1)
. . factors(0)
