program(7)
. <identifier>(1)
. . hanoi(0)
. consts(0)
. types(0)
. dclns(1)
. . var(2)
. . . <identifier>(1)
. . . . Disks(0)
. . . <identifier>(1)
. . . . integer(0)
. subprogs(1)
. . fcn(8)
. . . <identifier>(1)
. . . . Hanoi(0)
. . . params(1)
. . . . var(5)
. . . . . <identifier>(1)
. . . . . . a(0)
. . . . . <identifier>(1)
. . . . . . b(0)
. . . . . <identifier>(1)
. . . . . . c(0)
. . . . . <identifier>(1)
. . . . . . n(0)
. . . . . <identifier>(1)
. . . . . . integer(0)
. . . <identifier>(1)
. . . . integer(0)
. . . consts(0)
. . . types(0)
. . . dclns(0)
. . . block(3)
. . . . if(2)
. . . . . >(2)
. . . . . . <identifier>(1)
. . . . . . . n(0)
. . . . . . <integer>(1)
. . . . . . . 1(0)
. . . . . assign(2)
. . . . . . <identifier>(1)
. . . . . . . d(0)
. . . . . . call(5)
. . . . . . . <identifier>(1)
. . . . . . . . Hanoi(0)
. . . . . . . <identifier>(1)
. . . . . . . . a(0)
. . . . . . . <identifier>(1)
. . . . . . . . c(0)
. . . . . . . <identifier>(1)
. . . . . . . . b(0)
. . . . . . . -(2)
. . . . . . . . <identifier>(1)
. . . . . . . . . n(0)
. . . . . . . . <integer>(1)
. . . . . . . . . 1(0)
. . . . output(2)
. . . . . integer(1)
. . . . . . <identifier>(1)
. . . . . . . a(0)
. . . . . integer(1)
. . . . . . <identifier>(1)
. . . . . . . b(0)
. . . . if(2)
. . . . . >(2)
. . . . . . <identifier>(1)
. . . . . . . n(0)
. . . . . . <integer>(1)
. . . . . . . 1(0)
. . . . . assign(2)
. . . . . . <identifier>(1)
. . . . . . . d(0)
. . . . . . call(5)
. . . . . . . <identifier>(1)
. . . . . . . . Hanoi(0)
. . . . . . . <identifier>(1)
. . . . . . . . c(0)
. . . . . . . <identifier>(1)
. . . . . . . . b(0)
. . . . . . . <identifier>(1)
. . . . . . . . a(0)
. . . . . . . -(2)
. . . . . . . . <identifier>(1)
. . . . . . . . . n(0)
. . . . . . . . <integer>(1)
. . . . . . . . . 1(0)
. . . <identifier>(1)
. . . . Hanoi(0)
. block(2)
. . read(1)
. . . <identifier>(1)
. . . . Disks(0)
. . assign(2)
. . . <identifier>(1)
. . . . d(0)
. . . call(5)
. . . . <identifier>(1)
. . . . . Hanoi(0)
. . . . <integer>(1)
. . . . . 1(0)
. . . . <integer>(1)
. . . . . 3(0)
. . . . <integer>(1)
. . . . . 2(0)
. . . . <identifier>(1)
. . . . . Disks(0)
. <identifier>(1)
. . hanoi(0)
